export const questions = [
  {
    question: '게임을 할 때 나에게 채팅이란?',
    type: 'EI',
    answers: [
      {
        answer: '사소한 것이라도 소통을 해야 게임 할 맛이 나지.',
        type: 'EEE',
      },
      {
        answer: '최소한의 말만 하고 채팅은 거의 하지 않는다.',
        type: 'I',
      },
      {
        answer: '상대 팀의 멘탈을 부수기 위한 나의 무기.',
        type: 'E',
      },
      {
        answer: '채팅 하기도 귀찮고 하고 싶지도 않고 시끄럽다.',
        type: 'III',
      },
    ],
  },
  {
    question:
      '솔랭 픽창에서 서폿이 다른을 라인 잡았는데,\n서폿이 걸렸다고 라인 스왑을 해 달라고 찡찡 거린다.\n스왑을 안 해주면 던진다고 하는데.. 그때 나는?',
    type: 'NS',
    answers: [
      {
        answer: '입꾹닫. 알아서 하겠지 하고 조용히 내 라인 대로 픽을 한다.',
        type: 'S',
      },
      {
        answer:
          '팀들에게 스왑 가능 하냐고 같이 물어봐 주고, 정 안되면 내 라인을 양보 해준다.',
        type: 'N',
      },
      {
        answer:
          '아ㅋㅋ 벌써 할 맛 뚝 떨어지네." 채팅으로 화를 내고. 던지든 말든 양보는 안된다.',
        type: 'SSS',
      },
      {
        answer: '눈치 보다가 내 점수를 위해 닷지를 한다.',
        type: 'NNN',
      },
    ],
  },
  {
    question:
      '한타 승리 후 나는 포탑을 밀려고 했지만,\n팀들은 바론을 간다.\n아무리 봐도 포탑을 미는 게 맞는 거 같은데.. 그때 나는?',
    type: 'TF',
    answers: [
      {
        answer:
          '팀들에게 바론에 빽핑을 찍고, 포탑을 밀자고 포탑 핑을 찍어서 포탑을 밀도록 유도한다.',
        type: 'TTT',
      },
      {
        answer:
          '바론을 같이 안 가면 정치의 대상이 될 거 같아서 분위기 상 바론을 같이 가준다.',
        type: 'FFF',
      },
      {
        answer: '포탑을 밀어야 되는 이유를 간단 명료하게 설명하고 포탑을 민다.',
        type: 'T',
      },
      {
        answer:
          '다들 바론 가니깐 바론이 맞겠지? 한타가 이기기도 했고 팀에게 맞춰본다.',
        type: 'F',
      },
    ],
  },
  {
    question: '게임이 시작되었는데,\n로딩이 오래 걸릴 때 나의 행동은?',
    type: 'JP',
    answers: [
      {
        answer: '조합을 보며 어떤 식으로 플레이를 해야 할까 고민 한다.',
        type: 'JJJ',
      },
      {
        answer:
          "일시 정지 해 놨던 유튜브도 보고.. 웹툰도 좀 보고... '아 누가 똥컴이야.' 기다리기 바쁘다.",
        type: 'PPP',
      },
      {
        answer: '상대의 전적을 보면서 나름의 전략을 생각해본다.',
        type: 'J',
      },
      {
        answer: '로딩 창의 상대 숙련도와 챔피언 일러스트들을 보며 감상한다.',
        type: 'P',
      },
    ],
  },
  {
    question:
      '나는 못 했지만\n같은 팀 고수에게 캐리 당해서 꽁승을 했다. 그때 나는?',
    type: 'EI',
    answers: [
      {
        answer:
          '"저 진짜 반했는데 혹시 듀오 가능할까요? 이번엔 제대로 할 수 있습니다 ㅠ"',
        type: 'E',
      },
      {
        answer: '고수에게 캐리 해줘서 고맙다고 짧게 감사 인사를 한다.',
        type: 'I',
      },
      {
        answer:
          '상대 팀에게 "너무 상심 하지마~ 상대가 나잖아~ 점수 자알 가져갑니다~^^" 놀리기 바쁘다.',
        type: 'EEE',
      },
      {
        answer: '다음에 또 만났으면 하는 바람을 가지고 빠르게 큐를 돌린다.',
        type: 'III',
      },
    ],
  },
  {
    question: '새로운 챔피언이 출시해서 한번 플레이 해보려 한다.\n그때 나는?',
    type: 'NS',
    answers: [
      {
        answer: '챔피언 스킬 셋만 훑어보고 일단 해보고 이해한다.',
        type: 'S',
      },
      {
        answer: '스킬 공략 법을 최대한 찾아보고 이해하고 해본다.',
        type: 'NNN',
      },
      {
        answer: "'오 신챔!!' 무작정 해본다.",
        type: 'SSS',
      },
      {
        answer: '유튜버가 플레이 하는 영상을 보면서 배우고 해본다.',
        type: 'N',
      },
    ],
  },
  {
    question:
      '마지막 한번의 순간으로 승리와 패배가 갈리는 상황.\n하지만 친구가 순간 실수를 해서 결국 패배를 하였다.\n그때 나의 반응은?',
    type: 'TF',
    answers: [
      {
        answer:
          '"아 그때 너가 거기서 ㅇㅇㅇ했었으면 몰랐을 텐데 ㄲㅂ;; " 문제를 짚어주고 다음 판에 잘 해 보자는 식으로 말한다.',
        type: 'T',
      },
      {
        answer:
          '"ㄱㅊㄱㅊ 그럴 수도 있지. 상심 ㄴㄴ" 먼저 친구 기분이 상하지 않도록 위로한다.',
        type: 'F',
      },
    ],
  },
  {
    question:
      '오늘 나의 전적이 빨갛게 물들어 있다..\n10연패 행진 중이다. 그때 나는?',
    type: 'JP',
    answers: [
      {
        answer: '다른 게임도 좀 하고 잠깐 쉬었다가 한다.',
        type: 'JJJ',
      },
      {
        answer:
          '"진짜 짜증나네. 언제까지 이러나 한번 갈 때 까지 가보자" 끝장을 본다.',
        type: 'PPP',
      },
      {
        answer: '여기서 한판만 더 해보고 안 되면 진짜 그만 해야겠다.',
        type: 'J',
      },
      {
        answer: '아 몰라~ 팀운도 더럽게 없지~ 이쯤 되면 이기겠지',
        type: 'P',
      },
    ],
  },
  {
    question: '내가 선호 하는 게임은?',
    type: 'EI',
    answers: [
      {
        answer: '역시 사람이 많아야 재밌지~ 다인큐가 꿀잼!',
        type: 'E',
      },
      {
        answer: '롤은 역시 솔로 or 듀오',
        type: 'I',
      },
    ],
  },
  {
    question:
      '라인 전 중 웨이브가 몰려와서 라인을 받아 먹어야 하는 상황인데 미드와 정글끼리 교전이 일어났다.\n합류를 하면 우세를 가져갈 수 있을 거 같지만\n확실하진 않다.. 그때 나는?',
    type: 'NS',
    answers: [
      {
        answer:
          '이러다 망한 게 한 두 번이 아니야~ 빽핑을 찍고 라인을 받아 먹는다.',
        type: 'S',
      },
      {
        answer:
          '조금이라도 가능성이 보이면 라인을 포기하고 팀을 믿어보고 합류를 한다.',
        type: 'N',
      },
    ],
  },
  {
    question:
      '친구가 기분이 안 좋다고 갑자기 듀오를 하자고 한다.\n나의 반응은?',
    type: 'TF',
    answers: [
      {
        answer: '"? 기분이 안 좋은데 듀오는 왜 하자함?"',
        type: 'TTT',
      },
      {
        answer: '"기분이 왜 안 좋아?"',
        type: 'FFF',
      },
      {
        answer: '"기분 안 좋으면 롤 말고 다른 거 하는 게 낫지 않나?"',
        type: 'T',
      },
      {
        answer: '"롤 들어와"',
        type: 'F',
      },
    ],
  },
  {
    question:
      '게임에서 승리를 했지만,\n내 계획대로 흘러가지 않은 뭔가 찝찝한 승리다.\n그때 나는?',
    type: 'JP',
    answers: [
      {
        answer: "'아 그때 내가 그렇게 했으면 진작 끝나는 게임이었는데'",
        type: 'J',
      },
      {
        answer: "'뭐 어때 점수 너무 달당~'",
        type: 'P',
      },
    ],
  },
];
